Repository: vaseug/PowerLib.v2
Catalog: PowerLib.System/Validation/ArgumentMessage.*.resx
Languages: ru

# ArrayContainsMismatchedElements
source: Array argument '{0}' contains mismatched elements.
ru: Массив '{0}' содержит недопустимые элементы.

# ArrayDimensionsAreMismatched
source: Array argument '{0}' dimensions are mismatched.
ru: Элементы размерностей массива '{0}' содержат недопустимые элементы.

# ArrayDimLengthsAreMismatched
source: Array argument '{0}' dimensional lengths are mismatched.
ru: Длины размерностей массива '{0}' содержат недопустимые элементы.

# ArrayElementTypeIsMismatched
source: Array argument '{0}' element type is mismatched.
ru: Тип элементов массива '{0}' является недопустимым.

# ArrayIsEmpty
source: Array argument '{0}' is empty,
ru: Массив '{0}' является пустым.

# ArrayIsMultidimensional
source: Array argument '{0}' is multidimensional.
ru: Массив '{0}' является многомерным.

# ArrayIsNotEmpty
source: Array argument '{0}' is not empty.
ru: Массив '{0}' не является пустым.

# ArrayIsOnedimensional
source: Array argument '{0}' is onedimensional.
ru: Массив '{0}' является одномерным.

# ArrayLengthIsMismatched
source: Array argument '{0}' length is mismatched.
ru: Длина массива '{0}' является недопустимой.

# ArrayRankIsMismatched
source: Array argument '{0}' rank is mismatched.
ru: Ранг массива '{0}' является недопустимым.

# CollectionDoesNotContainRequiredMatchedElements
source: Collection argument '{0}' does not contain the required matched items.
ru: Коллекция '{0}' не содержит требуемых допустимых элементов.

# CollectionIsEmpty
source: Collection argument '{0}' is empty,
ru: Коллекция '{0}' не содержит элементов,

# CollectionIsMatched
source: Collection argument '{0}' is matched.
ru: Коллекция '{0}' удовлетворяет условию.

# CollectionIsNotEmpty
source: Collection argument '{0}' is not empty,
ru: Коллекция '{0}' не является пустой,

# CollectionIsNotReadOnly
source: Collection argument '{0}' is not read only.
ru: Коллекция '{0}' не только для чтения.

# CollectionIsNotRestrictedProperly
source: Collection argument '{0}' is not restricted properly.
ru: Коллекция '{0}' не является должным образом ограниченной.

# CollectionIsReadOnly
source: Collection argument '{0}' is read only.
ru: Коллекция '{0}' только для чтения.

# CollectionIsRestricted
source: Collection argument '{0}' is restricted.
ru: Коллекция '{0}' является ограниченной.

# CollectionsAreElementwiseCompared
source: Collection arguments '{0}' and '{1}' are elementwise compared.
ru: Коллекции '{0}' и '{1}' поэлементно сравнимы.

# CollectionsAreElementwiseEqual
source: Collection arguments '{0}' and '{1}' are elementwise equal.
ru: Коллекции '{0}' и '{1}' поэлементно равны.

# CollectionsAreNotElementwiseCompared
source: Collection arguments '{0}' and '{1}' are not elementwise compared.
ru: Коллекции '{0}' и '{1}' поэлементно не сравнимы.

# CollectionsAreNotElementwiseEqual
source: Collection arguments '{0}' and '{1}' are not elementwise equal.
ru: Коллекции '{0}' и '{1}' поэлементно не равны.

# CollectionsElementsCountsAreNotEqual
source: Element counts of the collection arguments '{0}' and '{1}' are not equal.
ru: Длины коллекций аргументов '{0}' and '{1}' не равны.

# DateTimeIntervalIsOutOfRange
source: DateTime interval specified by arguments '{0}' and '{1}' is out of range.
ru: Временной интервал задаваемый аргументами '{0}' and '{1}' находится за пределами допустимых значений.

# EnumFlagsAreEmpty
source: Enum flags of argument '{0}' are empty.
ru: Флаги перечисления аргумента '{0}' не заданы.

# EnumFlagsAreNotEmpty
source: Enum flags of argument '{0}' are not empty.
ru: Флаги перечисления аргумента '{0}' не пусты.

# EnumFlagsAreNotMatched
source: Enum flags of argument '{0}' are not matched to argument '{1}' by condition '{2}'.
ru: Флаги перечисления аргумента '{0}' не сопостовимы аргументу '{1}' по условию '{2}'.

# EnumTypeIsNotFlags
source: Enum type of argument '{0}' is not defined as flags.
ru: Тип аргумента перечисления '{0}' не определен как флаговый.

# IsBetween
source: Argument '{0}' is between arguments '{1}' and '{2}'.
ru: Значение аргумента '{0}' находится между значениями аргуменов '{1}' и '{2}'.

# IsCompared
source: Argument '{0}' is compared to argument '{1}'.
ru: Значение аргумента '{0}' сопоставимо значению аргумена '{1}'.

# IsConstructedFrom
source: Argument '{0}' type is constructed from generic type definition '{1}'.
ru: Тип аргумента '{0}' произведен из определения обобщенного типа '{1}'.

# IsDefault
source: Argument '{0}' has default value.
ru: Аргумент '{0}' содержит значение по умолчанию.

# IsEqual
source: Argument '{0}' is equal to argument '{1}'.
ru: Значение аргумента '{0}' равно значению аргумента '{1}'.

# IsExistIn
source: Argument '{0}' is exist in collection argument '{1}'.
ru: Значение аргумента '{0}' содержится в коллекции аргумента '{1}'.

# IsInstanceOfType
source: Argument '{0}' is instance of type '{1}'.
ru: Аргумент '{0}' является значением с типом '{1}'.

# IsInstanceOfTypeCode
source: Argument '{0}' is instance of typecode '{1}'.
ru: Аргумент '{0}' является значением с кодом типа '{1}'.

# IsInvalid
source: Argument '{0}' has invalid value.
ru: Аргумент '{0}' содержит недопустимое значение.

# IsNotBetween
source: Argument '{0}' is not between arguments '{1}' and '{2}'.
ru: Значение аргумента '{0}' не находится между значениями аргументов '{1}' и '{2}'.

# IsNotCompared
source: Argument '{0}' is not compared to argument '{1}'.
ru: Значение аргумента '{0}' несопоставимо значению аргумена '{1}'.

# IsNotConstructedFrom
source: Argument '{0}' type is not constructed from generic type definition '{1}'.
ru: Тип аргумента '{0}' не произведен из определения обобщенного типа '{1}'.

# IsNotDefault
source: Argument '{0}' has not default value.
ru: Аргумент '{0}' не содержит значение по умолчанию.

# IsNotEqual
source: Argument '{0}' is not equal to argument '{1}'.
ru: Значение аргумента '{0}' не равно значению аргумента '{1}'.

# IsNotExistIn
source: Argument '{0}' is not exist in collection argument '{1}'.
ru: Значение аргумента '{0}' не содержится в коллекции аргумента '{1}'.

# IsNotGenericTypeDefinition
source: Argument '{0}' is not generic type definition.
ru: Значение типа из аргумента '{0}' не является определением обобщенного типа.

# IsNotInstanceOfType
source: Argument '{0}' is not instance of type '{1}'.
ru: Аргумент '{0}' не является значением с типом '{1}'.

# IsNotInstanceOfTypeCode
source: Argument '{0}' is not instance of typecode '{1}'.
ru: Аргумент '{0}' не является значением с кодом типа '{1}'.

# IsNotNull
source: Argument '{0}' has not null value.
ru: Аргумент '{0}' не содержит нулевое значение.

# IsNull
source: Argument '{0}' has null value.
ru: Аргумент '{0}' содержит нулевое значение.

# IsOutOfRange
source: Argument '{0}' is out of range.
ru: Значение аргумента '{0}' находится за переделами допустимых значений.

# StringIsEmpty
source: String argument '{0}' is empty.
ru: Строковый аргумент'{0}' является пустым.

# StringIsEmptyOrWhitespace
source: String argument '{0}' is empty or contains whitespace characters.
ru: Строковый аргмент '{0}' является пустым или содержит пробельные символы.

# StringIsMatched
source: String argument '{0}' is matched to pattern argument '{1}'.
ru: Строковый аргумент '{0}' соответствует аргументу шаблона '{1}'.

# StringIsMismatched
source: String argument '{0}' is mismatched to pattern argument '{1}'.
ru: Строковый аргумент '{0}' не соответствует аргументу шаблона '{1}'.

# StringIsNotEmpty
source: String argument '{0}' contains any characters.
ru: Строковый аргумент '{0}' не является пустым.

# StringIsNotEmptyOrWhitespace
source: String argument '{0}' contains non-whitespace characters.
ru: Строковый аргумент '{0}' содержит непробельные символы.

# TypeDoesNotAllowNull
source: Argument '{0}' null value cannot be represented by type '{1}'.
ru: Аргумент '{0}' с нулевым значением не может быть представлен типом '{1}'.
